---
title: Autodesk.Aec.Geometry.NestedGridDivisionOverride
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > NestedGridDivisionOverride
---

# Autodesk.Aec.Geometry.NestedGridDivisionOverride

## Summary
Represents a nested grid division override.

## Properties

### GridAssignmentId
Gets or sets the grid assignment id.

**Returns:** The grid assignment id.

### DivisionDefinitionId
Gets or sets the division definition id.

**Returns:** The division definition id.

### IsStyleBased
Gets or sets whether this override is style based.

**Returns:** True to indicate style based, or false otherwise.

## Methods

### #ctor
Initializes a new instance of the NestedGridDivisionOverride class.