---
title: Autodesk.Aec.DatabaseServices.EditState
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > EditState
---

# Autodesk.Aec.DatabaseServices.EditState

## Summary
Represents an edit state object.

## Methods

### RegisterState(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Regiters the edit state for the specified entity.

- **`id`**: The id of the specified entity.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### UnregisterState(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Unregister the edit state from the specified entity.

- **`id`**: The id of the specified entity.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.