---
title: Autodesk.Aec.DatabaseServices.LayoutGrid3dNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid3dNode
---

# Autodesk.Aec.DatabaseServices.LayoutGrid3dNode

## Summary
Represents a layout grid 3d node.

## Properties

### WPosition
Gets or sets the node position on the W axis.

**Returns:** Returns the node position.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid3dNode class.