---
title: Autodesk.Aec.Modeler.UnspecifiedSurface
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > UnspecifiedSurface
---

# Autodesk.Aec.Modeler.UnspecifiedSurface

## Summary
Represents an unspecified surface.

## Methods

### #ctor
Initializes a new instance of the UnspecifiedSurface class.

### #ctor(Autodesk.Aec.Modeler.Body)
Initializes a new instance of the UnspecifiedSurface class using the specified body.

- **`body`**: The body.