---
title: Autodesk.Aec.DatabaseServices.DictionarySection2dStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionarySection2dStyle
---

# Autodesk.Aec.DatabaseServices.DictionarySection2dStyle

## Summary
Represents a section 2D style.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionarySection2dStyle class using the specified database.

- **`database`**: The database.

### GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets standard section 2D style.

- **`database`**: The database.

**Returns:** The standard section 2D style.