---
title: Autodesk.Aec.DatabaseServices.LayoutGrid3dCell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid3dCell
---

# Autodesk.Aec.DatabaseServices.LayoutGrid3dCell

## Summary
Represents a layout grid 3d cell.

## Properties

### WIndex
Gets or sets the index on the W axis.

**Returns:** Returns the index on the W axis.

### Plane
Gets or sets the plane type.

**Returns:** Returns the plane type.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid3dCell class.