---
title: Autodesk.Aec.Modeler.UnspecifiedCurve
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > UnspecifiedCurve
---

# Autodesk.Aec.Modeler.UnspecifiedCurve

## Summary
Represents a unspecified curve.

## Methods

### #ctor
Initializes a new instance of the UnspecifiedCurve class.

### #ctor(Autodesk.Aec.Modeler.Body)
Initializes a new instance of the UnspecifiedCurve class using the specified body.

- **`body`**: The body.