---
title: Autodesk.Aec.Modeler.CylinderSurface
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > CylinderSurface
---

# Autodesk.Aec.Modeler.CylinderSurface

## Summary
Represents a cylinder surface.

## Properties

### Radius
Gets the radius.

**Returns:** The radius.

### Approx
Gets the approx.

**Returns:** The approx.

## Methods

### #ctor
Initializes a new instance of the CylinderSurface class.

### #ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CylinderSurface class using the specified axis, radius, approx and body.

- **`axis`**: The axis.
- **`radius`**: The radius.
- **`approx`**: The approx.
- **`body`**: The body.

### #ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CylinderSurface class using the specified axis, start direction, radius, approx and body.

- **`axis`**: The axis.
- **`startDirection`**: The start direction.
- **`radius`**: The radius.
- **`approx`**: The approx.
- **`body`**: The body.