---
title: Autodesk.Aec.DatabaseServices.DisplayTheme
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DisplayTheme
---

# Autodesk.Aec.DatabaseServices.DisplayTheme

## Summary
Represents a display theme base class.

## Properties

### SupportsVisualStyle
Gets if it supports visual style.

**Returns:** True if it supports visual style, false otherwise.

### Scale
Gets or sets scale.

**Returns:** Scale.

### ParticipatesInDynamicUCS
Gets if it Participates in dynamic UCS.

**Returns:** True if it Participates in dynamic UCS, false otherwise.

### IsActive
Gets whether this display theme is active.

**Returns:** True if it is active, or false otherwise.

## Methods

### #ctor
Initializes a new instance of the DisplayTheme class.

### GetTransformMatrix
Gets transform matrix.

**Returns:** Transform matrix.

### GetExtentBoundBox()
Gets extent bound box.

### GetDimensionWidth()
Gets dimensions width.

- **`style`**: Style.

### GetDimensionHeight()
Gets dimensions height.

- **`style`**: Style.

### GetDimensionRowHeight()
Gets dimensions row height.

- **`style`**: Style.