---
title: Autodesk.Aec.DatabaseServices.Slice
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Slice
---

# Autodesk.Aec.DatabaseServices.Slice

## Summary
Represents a slice.

## Properties

### PlaneWidth
Gets or sets the width of the slice plane.

**Returns:** The width of the slice plane.

### PlaneDepth
Gets or sets the depth of the slice plane.

**Returns:** The depth of the slice plane.

### Profile
Get the profile generated by the slice and its attached objects.

**Returns:** The profile generated by the slice and its attached objects.

## Methods

### #ctor
Initializes a new instance of the Slice class.

### AppendObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Append/Attach an object to the slice.

- **`objectId`**: The ObjectId of the attached object.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### RemoveObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Remove/Detach an object from the slice.

- **`objectId`**: The ObjectId of the detached object.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### GetEntities
Get all attached entities/objects of the slice.

**Returns:** All attached entities/objects of the slice.