---
title: Autodesk.Aec.Modeler.CircleCurve
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > CircleCurve
---

# Autodesk.Aec.Modeler.CircleCurve

## Summary
Represents a circle curve.

## Properties

### Transf
Gets the transform matrix.

**Returns:** The transform matrix.

### Origin
Gets the origin point.

**Returns:** The origin point.

### Axis
Gets the axis line.

**Returns:** The axis line.

### Radius
Gets the radius.

**Returns:** The radius.

### Approx
Gets the approx.

**Returns:** The approx.

### Circle
Gets the circle.

**Returns:** The circle.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a wrapper class for CircleCurve.

### #ctor
Initializes a new instance of the CircleCurve class.

### #ctor(Autodesk.AutoCAD.Geometry.CircularArc3d,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CircleCurve class using the specified circle, approx and body.

- **`circle`**: The circle.
- **`approx`**: The approx.
- **`body`**: The body.