---
title: Autodesk.Aec.DatabaseServices.DictionaryDisplayConfiguration
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryDisplayConfiguration
---

# Autodesk.Aec.DatabaseServices.DictionaryDisplayConfiguration

## Summary
Helper class that accesses display configurations in the named object dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryDisplayConfiguration class using the specified database.

- **`db`**: The drawing database.

### GetStandardDisplayConfiguration(Autodesk.AutoCAD.DatabaseServices.Database)
Get the id of the standard view configuration for the specified drawing database.

- **`db`**: The drawing database.

**Returns:** Returns the object id of the standard view configuration.