---
title: Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > NestedGridDivisionRepeat
---

# Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat

## Summary
Represents a nested grid division repeat.

## Properties

### CellSize
Gets or sets the cell size.

**Returns:** The cell size.

### DistributeSlack
Gets or sets the state of the distribution slack.

**Returns:** The state of the distribution slack.

### DistributionFlags
Gets or sets the distribution flags.

**Returns:** The distribution flags.

## Methods

### #ctor
Initializes a new instance of the NestedGridDivisionRepeat class.