---
title: Autodesk.Aec.ApplicationServices.DatabaseDataManager
hierarchy: AecBaseMgd > Autodesk > Aec > ApplicationServices > DatabaseDataManager
---

# Autodesk.Aec.ApplicationServices.DatabaseDataManager

## Summary
Represents a Database data manager.

## Methods

### GetDatabaseData(Autodesk.AutoCAD.DatabaseServices.Database)
Get the Database data associated with the specified database.

- **`database`**: The specified database.

**Returns:** The database data corresponding to the specified database.

### GetAllDatabaseData
Get all dtabase data.

**Returns:** The database data pointers.