---
title: Autodesk.Aec.DatabaseServices.BlockReference
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > BlockReference
---

# Autodesk.Aec.DatabaseServices.BlockReference

## Summary
Represents a block reference.

## Properties

### BlockDefId
Gets or sets the block definition id.

**Returns:** Returns the block definition id.

### Scale
Gets or sets the scale.

**Returns:** Returns the scale.

## Methods

### #ctor
Initializes a new instance of the BlockReference class.