---
title: Autodesk.Aec.DatabaseServices.GridAssemblyCustomDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridAssemblyCustomDefinition
---

# Autodesk.Aec.DatabaseServices.GridAssemblyCustomDefinition

## Summary
Represents a grid assembly custom definition.

## Properties

### CustomGridDefinition
Gets or sets the custom grid.

**Returns:** Returns the custom grid, or null if none was set.

## Methods

### #ctor
Initializes a new instance of the GridAssemblyCustomDefinition class.