---
title: Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > AnchorEntityToLayoutNode
---

# Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode

## Summary
Represents an entity to a layout node anchor.

## Properties

### LayoutToolId
Gets or sets the Id of the layout tool.

**Returns:** Returns the Id of the layout tool.

### LayoutNodeId
Gets or sets the Id of the layout node.

**Returns:** Returns the Id of the layout node.

### LayoutNodeIndex
Gets or sets the index of the layout node.

**Returns:** Returns the index of the layout node.

### XRotation
Gets or sets the rotation in X.

**Returns:** Returns the rotation in X.

### YRotation
Gets or sets the rotation in Y.

**Returns:** Returns the rotation in Y.

### ZRotation
Gets or sets the rotation in Z.

**Returns:** Returns the rotation in X.

### OffsetVector
Gets or sets the offset vector.

**Returns:** Returns the offset vector.

### NormalVector
Gets or sets the normal vector.

**Returns:** Returns the normal vector.

### FlipX
Gets or sets the flip in X value.

**Returns:** Returns the flip in X value.

### FlipY
Gets or sets the flip in Y value.

**Returns:** Returns the flip in Y value.

### FlipZ
Gets or sets the flip in Z value.

**Returns:** Returns the flip in Z value.

### UseLocalCoordinateSystem
Gets or sets the value that determines if the local coordinate system is used.

**Returns:** Returns the value that determines if the local coordinate system is used.

### OffsetToCenter
Gets or sets the offset to center value.

**Returns:** Returns the offset to center value.

## Methods

### #ctor
Initializes a new instance of the AnchorEntityToLayoutNode class.