---
title: Autodesk.Aec.DatabaseServices.GridCustomCell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridCustomCell
---

# Autodesk.Aec.DatabaseServices.GridCustomCell

## Summary
Represents a grid cell custom.

## Properties

### ExtractNodeCount
Gets the node count.

**Returns:** The node count.

### NodeInformationCollection
Gets the node information collection.

**Returns:** The node information collection.

- **Exception `T:System.Exception`**: System.Exception.

### CalculateCellProfile
Gets the custom cell grid profile.

**Returns:** The custom cell grid profile, or null if there none defined yet.

## Methods

### #ctor
Initializes a new instance of the GridCustomCell class.