---
title: Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GsMarkerDisplayComponentInformationNode
---

# Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode

## Summary
Represents a node of the GsMarker information related to the display component.

## Properties

### DisplayComponentName
Gets or sets the display component name.

**Returns:** The display component name.

### ParentDisplayRepresentationInformationNode
Gets or sets the parent node of the display component information.

### DisplayPropertiesId
Gets the object id of the display properties.

**Returns:** The object id of the display properties.

### DisplayRepresentationId
Gets the object id of the display representation.

**Returns:** The object id of the display representation.

## Methods

### #ctor
Initializes a new instance of the GsMarkerDisplayComponentInformationNode class.

### #ctor(System.String,Autodesk.Aec.DatabaseServices.GsMarkerInformationTree,Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Initializes a new instance of the GsMarkerDisplayComponentInformationNode class using the specified name, parent tree and parent node.

- **`name`**: The specified name.
- **`parentTree`**: The specified parent tree.
- **`parentNode`**: The specified parent node.