---
title: Autodesk.Aec.DatabaseServices.GraphicsStorageBody
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorageBody
---

# Autodesk.Aec.DatabaseServices.GraphicsStorageBody

## Summary
Represents a graphics storage that stores body data.

## Properties

### Body
Gets the body.

**Returns:** The body.

### DiscardedEdgeFaceMask
Gets the mask of the discarded edge face.

**Returns:** The mask of the discarded edge face.