---
title: Autodesk.Aec.DatabaseServices.Anchor
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Anchor
---

# Autodesk.Aec.DatabaseServices.Anchor

## Summary
Represents an anchor.

## Methods

### #ctor
Initializes a new instance of the Anchor class.