---
title: Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutVolume
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > AnchorEntityToLayoutVolume
---

# Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutVolume

## Summary
Represents an entity to a layout volume anchor.

## Methods

### #ctor
Initializes a new instance of the AnchorEntityToLayoutVolume class.