---
title: Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > ParameterChangeListenerManager
---

# Autodesk.Aec.DatabaseServices.ParameterChangeListenerManager

## Summary
Represents a Listener Manager.

## Methods

### #ctor
Initializes a new instance of the ParameterChangeListenerManager class.

### RegisterListener(Autodesk.Aec.DatabaseServices.Listener)
Registers the listener.

- **`pListener`**: The input listener.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### UnRegisterListener(Autodesk.Aec.DatabaseServices.Listener)
Unregisters the listener.

- **`listener`**: The input listener.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.