---
title: Autodesk.Aec.DatabaseServices.LineWorkComponent
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LineWorkComponent
---

# Autodesk.Aec.DatabaseServices.LineWorkComponent

## Summary
Represents a line work component.

## Properties

### Id
Gets or sets the ID.

**Returns:** The component ID.

### Name
Gets or sets the name.

**Returns:** The name.

### Description
Gets or sets the description of line work component.

**Returns:** The discription of it.

## Methods

### #ctor
Initializes a new instance of the LineWorkComponent class.