---
title: Autodesk.Aec.DatabaseServices.GridUvRadial
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridUvRadial
---

# Autodesk.Aec.DatabaseServices.GridUvRadial

## Summary
Represents a Radial Grid.

## Properties

### UInsideRadius
Gets or sets the U inside radius.

**Returns:** The U inside radius.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### VAxisAngle
Gets or sets the V axis angle.

**Returns:** The V axis angle.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### VAngleSpacing
Gets or sets the V angle spacing.

**Returns:** The V angle spacing.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### VStartAngleOffset
Input the V starting angle offset.

**Returns:** The V starting angle offset.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### VEndAngleOffset
Gets or sets the V end angle offset.

**Returns:** The V end angle offset.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

## Methods

### #ctor
Initializes a new instance of the GridUvRadial class.