---
title: Autodesk.Aec.DatabaseServices.Section2dSegmentGroup
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Section2dSegmentGroup
---

# Autodesk.Aec.DatabaseServices.Section2dSegmentGroup

## Summary
Represents a section 2D segment group.

## Properties

### MaterialId
Gets or sets the material ID.

**Returns:** The material ID.

### SurfaceHatchingSegments
Gets the surface hatching segments.

**Returns:** The surface hatching segments.

### SectionHatchingSegments
Gets the section hatching segments.

**Returns:** The section hatching segments.

### LineWorkSegments
Gets the line work segments.

**Returns:** The line work segments.

### HasUserEdits
Determine if it has user edits.

**Returns:** true if it has user edits, false otherwise.

## Methods

### #ctor
Initializes a new instance of the Section2dSegmentGroup class.

### RemoveAllButUserEdits
Remove all but user edits.