---
title: Autodesk.Aec.DatabaseServices.AttributeId
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > AttributeId
---

# Autodesk.Aec.DatabaseServices.AttributeId

## Summary
Represents an AEC attribute id.

## Properties

### Id
Gets the AEC related object id.

**Returns:** The AEC related object id.

## Methods

### #ctor
Initializes a new instance of the AttributeId class.

### #ctor(Autodesk.Aec.DatabaseServices.ObjectId)
Initializes a new instance of the AttributeId class using the specified AEC related object id.

- **`aecObjectId`**: Input the AEC related object id.