---
title: Autodesk.Aec.DatabaseServices.Section2dStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Section2dStyle
---

# Autodesk.Aec.DatabaseServices.Section2dStyle

## Summary
Represents a section 2D style.

## Properties

### LineWorkComponents
Gets line work components.

**Returns:** The line work components.

### LineWorkRules
Gets the line work rules.

**Returns:** The line work rules.

### KeepAllHiddenLineWork
Determine if it keeps all hidden line work.

**Returns:** true if it keeps all hidden line work, false otherwise.

### UseObjectDisplayProperty
Gets or sets to know if it uses object display properties or not.

**Returns:** True if it uses object display properties, otherwise false.

## Methods

### #ctor
Initializes a new instance of the Section2dStyle class.