---
title: Autodesk.Aec.DatabaseServices.NestedGridDivisionDivideBy
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > NestedGridDivisionDivideBy
---

# Autodesk.Aec.DatabaseServices.NestedGridDivisionDivideBy

## Summary
Represents a nested grid division divide by.

## Properties

### DivideByCount
Gets or sets the divide by count value.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

## Methods

### #ctor
Initializes a new instance of the NestedGridDivisionDivideBy class.