---
title: Autodesk.Aec.DatabaseServices.AnchorLeaderToNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > AnchorLeaderToNode
---

# Autodesk.Aec.DatabaseServices.AnchorLeaderToNode

## Summary
Represents a leader to a node anchor.

## Properties

### FirstExtension
Gets or sets the length of the first leader extension.

**Returns:** Returns the length of the first leader extension.

### SecondExtension
Gets or sets the length of the second leader extension.

**Returns:** Returns the length of the first leader extension.

### Angle
Gets or sets the angle of the leader.

**Returns:** Returns the angle of the leader.

### Vectors
Gets the collection of vectors.

**Returns:** Returns the collection of vectors.

## Methods

### #ctor
Initializes a new instance of the AnchorLeaderToNode class.