---
title: Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridAssemblyComponentSet
---

# Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet

## Summary
Represents a grid assembly component set.

## Methods

### #ctor
Initializes a new instance of the GridAssemblyComponentSet class.

### IncrementComponentDefinitionId
Increments the component definition id, and returns the new value.

**Returns:** The next component definition id.