---
title: Autodesk.Aec.DatabaseServices.SectionSegment
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > SectionSegment
---

# Autodesk.Aec.DatabaseServices.SectionSegment

## Summary
Represents a section segment.

## Properties

### IsMergedSegment
Determine if it is merged segment.

**Returns:** true if it is merged segment, false otherwise.

### MarkedFromEdit
Determine if it is marked from edit.

**Returns:** true if it is marked from edit, false otherwise.

### IsAPoint
Determine if it is a point.

**Returns:** true if it is a point, false otherwise.

### ComponentId
Gets or sets the component ID.

**Returns:** The component ID.

### StartPoint
Gets or sets the start point.

**Returns:** The start point.

### EndPoint
Gets or sets the end point.

**Returns:** The end point.

### LineWorkType
Gets the line work type.

**Returns:** The line work type.

## Methods

### #ctor
Initializes a new instance of the SectionSegment class.