---
title: Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > IndexSpecifierBoundaryEdge
---

# Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge

## Summary
Represents an index specifier boundary edge.

## Properties

### OnTop
Returns true if boundary edge is on the top, false otherwise.

**Returns:** true if boundary edge is on the top, false otherwise.

### OnLeft
Returns true if boundary edge is on the left, false otherwise.

**Returns:** true if boundary edge is on the left, false otherwise.

### OnBottom
Returns true if boundary edge is on the bottom, false otherwise.

**Returns:** true if boundary edge is on the bottom, false otherwise.

### OnRight
Returns true if boundary edge is on the right, false otherwise.

**Returns:** true if boundary edge is on the right, false otherwise.

### BoundaryFlags
Gets or sets the boundary location flags.

**Returns:** Returns the boundary location flags.

## Methods

### #ctor
Initializes a new instance of the IndexSpecifierBoundaryEdge class.