---
title: Autodesk.Aec.ApplicationServices.DatabaseData
hierarchy: AecBaseMgd > Autodesk > Aec > ApplicationServices > DatabaseData
---

# Autodesk.Aec.ApplicationServices.DatabaseData

## Summary
Represents a database data.

## Properties

### Database
Gets the database associated with the database data.

**Returns:** The database associated with the database data.

### DrawingInitedAndPromoted
Gets or sets the boolean value if the drawing is inited and prompted.

**Returns:** The boolean value if the drawing is inited and prompted.

## Methods

### #ctor
Initializes a new instance of the DatabaseData class.