---
title: Autodesk.Aec.DatabaseServices.PropertyBase
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > PropertyBase
---

# Autodesk.Aec.DatabaseServices.PropertyBase

## Summary
Represents Property Base.

## Properties

### DataType
Gets or sets the property data type.

**Returns:** The property data type.

### Name
Gets or sets the name.

**Returns:** The name.

## Methods

### #ctor
Initializes a new instance of the PropertyBase class.