---
title: Autodesk.Aec.DatabaseServices.GraphicsStorageArc
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorageArc
---

# Autodesk.Aec.DatabaseServices.GraphicsStorageArc

## Summary
Represents a graphics storage that stores arc data.

## Properties

### Arc
Gets the arc.

**Returns:** The arc.