---
title: Autodesk.Aec.DatabaseServices.GraphicsStorage
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorage
---

# Autodesk.Aec.DatabaseServices.GraphicsStorage

## Summary
Represents a graphics storage.

## Properties

### LayerId
Gets the layer id.

**Returns:** The layer id.

### LinetypeId
Gets the line type id.

**Returns:** The line type id.

### ColorIndex
Gets the color index.

**Returns:** The index.

### Color
Gets the color.

**Returns:** The color.

### GsMarker
Gets the gs marker.

**Returns:** The gs marker.

### LineWeight
Gets the line weight.

**Returns:** The line weight.

### LineTypeScale
Gets the line type scale.

**Returns:** The line type scale.

### MaterialId
Gets the material id.

**Returns:** The object id.

### PlotStyleType
Gets the plot style name type.

**Returns:** The plot style name type.

### PlotStyleNameId
Gets the plot style name id.

**Returns:** The plot style name id.

### GeometryExtents
Gets the geometry extents.

**Returns:** The geometry extents.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.