---
title: Autodesk.Aec.DatabaseServices.LayoutNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutNode
---

# Autodesk.Aec.DatabaseServices.LayoutNode

## Summary
Represents a layout node.

## Properties

### NodeId
Gets or sets the node id.

**Returns:** The node id.

## Methods

### #ctor
Initializes a new instance of the LayoutNode class.