---
title: Autodesk.Aec.DatabaseServices.MassElementStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > MassElementStyle
---

# Autodesk.Aec.DatabaseServices.MassElementStyle

## Summary
Represents a mass element style.

## Properties

### MaterialId
Gets or sets the material id.

**Returns:** Returns the material id.

## Methods

### #ctor
Initializes a new instance of the MassElementStyle class.