---
title: Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > NestedGridEdgeDefinition
---

# Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition

## Summary
Represents a nested grid edge definition.

## Properties

### Id
Gets or sets the id of the nested grid edge.

**Returns:** Returns the id of the nested grid edge.

### Name
Gets or sets the name of the nested grid edge.

**Returns:** A string with the name of the nested grid edge.

### EdgeWidth
Gets or sets the width of the edge.

**Returns:** The width of the edge.

### EdgeDepth
Gets or sets the depth of the edge.

**Returns:** The depth of the edge.

### EdgeOffset
Gets or sets the edge offset.

**Returns:** The edge offset.

### DepthOffset
Gets or sets the depth offset.

**Returns:** The depth offset.

### StartOffset
Gets or sets the start offset distance.

**Returns:** The start offset distance.

### EndOffset
Gets or sets the end offset distance.

**Returns:** The end offset distance.

### ProfileId
Gets or sets the profile id.

**Returns:** The profile id.

### ScaleProfileX
Gets or sets the state of the X scale of the profile.

**Returns:** true if profile is scaled in X, false otherwise.

### ScaleProfileY
Gets or sets the state of the Y scale of the profile.

**Returns:** true if profile is scaled in Y, false otherwise.

### CleanupInternalEdges
Gets or sets the state of the Cleanup Internal Edges flag.

**Returns:** The state.

### MirrorProfileX
Gets or sets the state of the mirroring in X of the profile.

**Returns:** true if profile is mirrored in X, false otherwise.

### MirrorProfileY
Gets or sets the state of the mirroring in Y of the profile.

**Returns:** true if profile is mirrored in Y, false otherwise.

### ProfileRotation
Gets or sets the rotation angle of the profile.

**Returns:** The rotation angle.

### MaterialId
Gets or sets the material id for this grid edge definition.

**Returns:** The material id.

## Methods

### #ctor
Initializes a new instance of the NestedGridEdgeDefinition class.