---
title: Autodesk.Aec.DatabaseServices.ReferenceDocument
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > ReferenceDocument
---

# Autodesk.Aec.DatabaseServices.ReferenceDocument

## Summary
Represents a reference document.

## Properties

### FilePath
Gets the file path.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### FileFullPath
Gets the file fullpath.

**Returns:** Returns the file full path.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

**Remarks:**
If the path is relative, the current database path is appended.

### ExtensionDictionaryName
Get the name of extension dictionary.

**Returns:** The name of extension dictionary.

## Methods

### #ctor
Initializes a new instance of the ReferenceDocument class.