---
title: Autodesk.Aec.Modeler.MorphingMapElement
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > MorphingMapElement
---

# Autodesk.Aec.Modeler.MorphingMapElement

## Summary
Represents a element of morphing map.

## Methods

### #ctor
Initializes a new instance of the MorphingMapElement class.

### #ctor(System.Int32,System.Int32,System.Int32)
Initializes a new instance of the MorphingMapElement class.

### op_Equality(Autodesk.Aec.Modeler.MorphingMapElement, Autodesk.Aec.Modeler.MorphingMapElement)
Compares equality of two objects of MorphingMapElement type.

### op_Inequality(Autodesk.Aec.Modeler.MorphingMapElement, Autodesk.Aec.Modeler.MorphingMapElement)
Compares inequality of two objects of MorphingMapElement type.

## Fields

### FromIndex
The From Index.

### ToIndex
The To Index.

### Visibility
The Visibility.