---
title: Autodesk.Aec.Geometry.CompoundCurve2dVertex
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > CompoundCurve2dVertex
---

# Autodesk.Aec.Geometry.CompoundCurve2dVertex

## Summary
Represents a compound curve 2d vertex.

## Properties

### CompoundCurve
Returns the CompoundCurve2d.

**Returns:** Returns the CompoundCurve2d.

### PreviousSegment
Returns the segment before this vertex.

**Returns:** Returns the segment before this vertex.

### NextSegment
Returns the segment after this vertex.

**Returns:** Returns the segment after this vertex.

### Point
Returns the location of the vertex.

**Returns:** Returns the location of the vertex.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a wrapper class for AecGeCompCurve2dVertex.

### #ctor
Initializes a new instance of the CompoundCurve2dVertex class.

### Clone
Clones the wrapped object.

### DeleteUnmanagedObject()
Cleans up the wrapped object.