---
title: Autodesk.Aec.DatabaseServices.DisplayThemeStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DisplayThemeStyle
---

# Autodesk.Aec.DatabaseServices.DisplayThemeStyle

## Summary
Represents a display theme style class.

## Properties

### GetDisplayThemeComponents
Gets display theme components.

### CellFormat
Gets cell format.

**Returns:** Display theme cell format.

### Title
Gets or sets title of this display theme style.

**Returns:** Title.

## Methods

### #ctor
Initializes a new instance of the DisplayThemeStyle class.

### GetDisplayThemeDisplayPropsForEntity(Autodesk.Aec.DatabaseServices.Entity)
Gets display theme display properties for entity.

- **`entity`**: Entity.

**Returns:** Display component hatch.

### GetDisplayThemeDisplayPropsForEntity(Autodesk.Aec.DatabaseServices.Entity,System.Int32)
Gets display theme display properties for entity.

- **`entity`**: Entity.
- **`componentIndex`**: Component index.

**Returns:** Display component hatchs.