---
title: Autodesk.Aec.DatabaseServices.DictionaryMassElementStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryMassElementStyle
---

# Autodesk.Aec.DatabaseServices.DictionaryMassElementStyle

## Summary
Represents a mass element style dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMassElementStyle class using the specified database.

- **`db`**: The database.

### GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard style id.

- **`db`**: The database.

**Returns:** Returns the standard style id.