---
title: Autodesk.Aec.DatabaseServices.DictionaryRecordAlternateNameTranslator
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryRecordAlternateNameTranslator
---

# Autodesk.Aec.DatabaseServices.DictionaryRecordAlternateNameTranslator

## Summary
Represents a name translator.

## Methods

### #ctor
Initializes a new instance of the DictionaryRecordAlternateNameTranslator class.

### Create(System.IntPtr,System.Boolean)
Creates a new instance of the DictionaryRecordAlternateNameTranslator class.

- **`unmanagedPointer`**: Inputs the unmanaged pointer of DictionaryRecordAlternateNameTranslator object.
- **`autoDelete`**: Inputs true if unmanaged object is destroyed by wrapper, otherwise false.