---
title: Autodesk.Aec.DatabaseServices.DictionaryProfileDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryProfileDefinition
---

# Autodesk.Aec.DatabaseServices.DictionaryProfileDefinition

## Summary
Represents a profile definition dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryProfileDefinition class using the specified database.

- **`db`**: The database.

### GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard definition id.

- **`db`**: The database.

**Returns:** Returns the standard definition id.