---
title: Autodesk.Aec.DatabaseServices.DictionaryMaskBlockDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryMaskBlockDefinition
---

# Autodesk.Aec.DatabaseServices.DictionaryMaskBlockDefinition

## Summary
Represents a mask block definition dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMaskBlockDefinition class using the specified database.

- **`db`**: The drawing database.

### GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the id of the standard mask block definition, which is always available, for the specified drawing database.

- **`db`**: The drawing database.

**Returns:** Returns the object id of the standard mask block definition.