---
title: Autodesk.Aec.DatabaseServices.DisplayRepresentationTData
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DisplayRepresentationTData
---

# Autodesk.Aec.DatabaseServices.DisplayRepresentationTData

## Summary
Represents a class which is a place that the display representation can stick data related to the draw session of a given entity.

## Properties

### Properties
Gets or sets the display properties.

**Returns:** Returns the display properties.

## Methods

### #ctor
Initializes a new instance of the DisplayRepresentationTData class.

### MaskProfilePushCount
Gets or sets the count of mask profile push.

**Returns:** Returns the count of mask profile push.