---
title: Autodesk.Aec.DatabaseServices.DictionaryPolygonStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryPolygonStyle
---

# Autodesk.Aec.DatabaseServices.DictionaryPolygonStyle

## Summary
Represents a polygon style dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPolygonStyle class using the specified database.

- **`db`**: The database.

### GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard style id.

- **`db`**: The database.

**Returns:** Returns the standard style id.