---
title: Autodesk.Aec.DatabaseServices.TextNote
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > TextNote
---

# Autodesk.Aec.DatabaseServices.TextNote

## Summary
Represents a test note.

## Properties

### Note
Gets or sets the note.

**Returns:** Returns the note.

### ExtensionDictionaryName
Get the name of extension dictionary.

**Returns:** The name of extension dictionary.

## Methods

### #ctor
Initializes a new instance of the TextNote class.

### GetStandardNote(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the standard note.

- **`instance`**: The object instance.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### SetStandardNote(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Sets the standard note.

- **`instance`**: The object instance.
- **`note`**: The note.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.