---
title: Autodesk.Aec.DatabaseServices.GraphicsStorageFace
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorageFace
---

# Autodesk.Aec.DatabaseServices.GraphicsStorageFace

## Summary
Represents a graphics storage that stores face data.

## Properties

### Points
Gets the points of the face in this storage.

**Returns:** The points of the face.

### EdgeVisibility
Gets the visibility of the edges of the face.

**Returns:** The visibility of the edges.