---
title: Autodesk.Aec.Geometry.NestedGridCellMergeData
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > NestedGridCellMergeData
---

# Autodesk.Aec.Geometry.NestedGridCellMergeData

## Summary
Represents nested grid cell merge data.

## Properties

### PrimaryCellPath
Gets or sets the primary cell path.

**Returns:** The primary cell path.

### SecondaryCellPath
Gets or sets the secondary cell path.

**Returns:** The secondary cell path.

### IsStyleBased
Gets or sets whether the merge data is style based.

**Returns:** True to indicate style based, or false otherwise.

## Methods

### #ctor
Initializes a new instance of the NestedGridCellMergeData class.