---
title: Autodesk.Aec.DatabaseServices.LayoutCell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutCell
---

# Autodesk.Aec.DatabaseServices.LayoutCell

## Summary
Represents a layout cell.

## Properties

### CellId
Gets or sets the cell id.

**Returns:** Returns the cell id.

## Methods

### #ctor
Initializes a new instance of the LayoutCell class.