---
title: Autodesk.Aec.DatabaseServices.DictionaryClassificationDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryClassificationDefinition
---

# Autodesk.Aec.DatabaseServices.DictionaryClassificationDefinition

## Summary
Represents a classification dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryClassificationDefinition class using the specified database.

- **`db`**: The drawing database.