---
title: Autodesk.Aec.Modeler.SphereSurface
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > SphereSurface
---

# Autodesk.Aec.Modeler.SphereSurface

## Summary
Represents a sphere surface.

## Properties

### Center
Gets the center point.

**Returns:** The center point.

### Radius
Gets the radius.

**Returns:** The radius.

### Approx
Gets the approx.

**Returns:** Returns the approx.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a wrapper class for SphereSurface.

### #ctor
Initializes a new instance of the SphereSurface class.

### #ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the SphereSurface class using the specified point, radius, approx and body.

- **`origin`**: The origin point.
- **`radius`**: The radius.
- **`approx`**: The approx.
- **`body`**: The body.