---
title: Autodesk.Aec.Modeler.VertexSurfaceData
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > VertexSurfaceData
---

# Autodesk.Aec.Modeler.VertexSurfaceData

## Summary
Represents a vertex surface data.

## Properties

### Surface
Gets or sets the surface.

**Returns:** The surface.

### Normal
Gets the normal vector.

**Returns:** The normal vector.

## Methods

### #ctor
Initializes a new instance of the VertexSurfaceData class.

### #ctor(Autodesk.Aec.Modeler.Edge)
Initializes a new instance of the VertexSurfaceData class using the specified edge.

- **`edge`**: The edge.

### Transform(Autodesk.AutoCAD.Geometry.Matrix3d)
Transfer from a matrix.

- **`matrix`**: The matrix.