---
title: Autodesk.Aec.DatabaseServices.ListItem
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > ListItem
---

# Autodesk.Aec.DatabaseServices.ListItem

## Summary
Represents a list item.

## Methods

### #ctor
Initializes a new instance of the ListItem class.