---
title: Autodesk.Aec.Modeler.RevolutionSurface
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > RevolutionSurface
---

# Autodesk.Aec.Modeler.RevolutionSurface

## Summary
Represents a revolution surface.

## Properties

### Axis
Gets the axis line.

**Returns:** Returns the axis line.

### StartDir
Gets the start vector.

**Returns:** Returns the start vector.