---
title: Autodesk.Aec.DatabaseServices.LayoutVolume
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutVolume
---

# Autodesk.Aec.DatabaseServices.LayoutVolume

## Summary
Represents a layout volume.

## Properties

### VolumeId
Gets or sets the volume id.

**Returns:** Returns the volume id.

## Methods

### #ctor
Initializes a new instance of the LayoutVolume class.