---
title: Autodesk.Aec.DatabaseServices.DisplayComponent
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DisplayComponent
---

# Autodesk.Aec.DatabaseServices.DisplayComponent

## Summary
Represents a display component base class.

## Properties

### IsApplicable
Check if it is applicable.

**Returns:** True if it is applicable, false otherwise.

### IsInherited
Gets or sets if it is inherited.

**Returns:** True if it is inherited, false otherwise.

## Methods

### #ctor
Initializes a new instance of the DisplayComponent class.

### Reset
Resets.