---
title: Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > OverrideMaterialAssignment
---

# Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment

## Summary
Represents a override material assignment class.

## Properties

### MaterialId
Gets or sets material id.

**Returns:** Material id.

### ComponentId
Gets or sets component id.

**Returns:** Component id.

### LocationId
Gets or sets location id.

**Returns:** Location id.

## Methods

### #ctor
Initializes a new instance of the OverrideMaterialAssignment class.