---
title: Autodesk.Aec.DatabaseServices.LineWorkRule
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LineWorkRule
---

# Autodesk.Aec.DatabaseServices.LineWorkRule

## Summary
Represents a line work rule.

## Properties

### Color
Gets or sets the color.

**Returns:** The color.

### FilterFlags
Gets or sets the filter flags.

**Returns:** The filter flags.

### ComponentId
Gets or sets the component ID.

**Returns:** The component ID.

### Description
Gets or sets the description of it.

**Returns:** The description of it.

## Methods

### #ctor
Initializes a new instance of the LineWorkRule class.