---
title: Autodesk.Aec.DatabaseServices.GraphicsStoragePolyline
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStoragePolyline
---

# Autodesk.Aec.DatabaseServices.GraphicsStoragePolyline

## Summary
Represents a graphics storage that stores polyline data.

## Properties

### Points
Gets the points of the polyline.

**Returns:** The points of the polyline.