---
title: Autodesk.Aec.DatabaseServices.ClipVolumeResult
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > ClipVolumeResult
---

# Autodesk.Aec.DatabaseServices.ClipVolumeResult

## Summary
Represents a result of clip volume..

## Properties

### ClipVolumeId
Gets or sets the ObjectId of the ClipVolume of this clip volume result.

**Returns:** The ObjectId of the ClipVolume of this clip volume result.

## Methods

### #ctor
Initializes a new instance of the ClipVolumeResult class.