---
title: Autodesk.Aec.DatabaseServices.ClipVolume
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > ClipVolume
---

# Autodesk.Aec.DatabaseServices.ClipVolume

## Summary
Represents a clip volume.

## Properties

### Vertices
Get the vertices of the clip volume.

**Returns:** The vertices of the clip volume.

### EcsVertices
Gets or sets the Ecs vertices of the clip volume.

**Returns:** The Ecs vertices of the clip volume.

### ViewSetId
Gets or sets the view set of this clip volume via ObjectId.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### AngleA
Gets or sets the value of angle A of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### AngleB
Gets or sets the value of angle B of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### LengthA
Gets or sets the length A of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### LengthB
Gets or sets the length B of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Height
Gets or sets the height of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### LowerExtension
Gets or sets the lower extension of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### UseModelExtentsForHeight
Gets or sets if use model extension for height.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### IncludedEntities
Gets or sets the included entities of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Subdivisions
Gets or sets the subdivision of the clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Name
Gets or sets the name of this component.

**Returns:** The name of this component.

## Methods

### #ctor
Initializes a new instance of the ClipVolume class.

### GetBody(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Get the body generated by the clip volume and the Object specified by the ObejctId.

- **`id`**: The Id of the Object that is used for Body generation.

**Returns:** The generated Body.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### SetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Plane)
Set the vertices of the clip volume.

- **`points`**: The vertices of this clip volume.
- **`sectionPlane`**: The section plane of this clip volume.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Reverse
Reverse the clip volume.