---
title: Autodesk.Aec.DatabaseServices.IndexSpecifier
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > IndexSpecifier
---

# Autodesk.Aec.DatabaseServices.IndexSpecifier

## Summary
Represents an index specifier.

## Methods

### #ctor
Initializes a new instance of the IndexSpecifier class.

### AppliesToIndex(System.Int32,System.Int32,System.Int32)
Determines if the given index applies.

- **`index`**: The index.
- **`startIndex`**: The start index.
- **`endIndex`**: The end index.

**Returns:** Returns true if the given index applies.

**Remarks:**
Must be handled by the derived classes.