---
title: Autodesk.Aec.DatabaseServices.LayerKeyDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayerKeyDefinition
---

# Autodesk.Aec.DatabaseServices.LayerKeyDefinition

## Summary
Represents a layer key definition.

## Properties

### Key
Gets or sets the key.

### LayerName
Gets or sets the layer name.

### Color
Gets or sets the color.

### Linetype
Gets or sets the line type.

### Lineweight
Gets or sets the line weight.

### Plotstyle
Gets or sets the plot style.

### IsPlottable
Gets or sets the value that determines if it is plottable.

### Removable
Determines if the definition is removable from the style.

**Returns:** Returns true if the definition is removable from the style.

**Remarks:**
A key is not removeable if it is in the list of default layer keys.

### Overrides
Gets the overrides in the layer key definition.

**Returns:** The overrides.

## Methods

### #ctor
Initializes a new instance of the LayerKeyDefinition class.