---
title: Autodesk.Aec.DatabaseServices.GraphicsStorageShell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorageShell
---

# Autodesk.Aec.DatabaseServices.GraphicsStorageShell

## Summary
Represents a graphics storage that stores shell data.

## Properties

### Vertices
Gets the vertices of the shell.

**Returns:** The vertices of the shell.

### FaceList
Gets the face list of the shell.

**Returns:** The face list of the shell.

**Remarks:**
Negative values in the array indicate holes.

### FaceData
Gets the face data of the shell.

**Returns:** The face data of the shell.

### EdgeData
Gets the edge data of the shell.

**Returns:** The edge data of the shell.