---
title: Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > NestedGridDivisionManualEdgeDefinition
---

# Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition

## Summary
Represents a nested grid division manual edge definition.

## Properties

### AxisReference
Gets or sets the axis reference type.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Offset
Gets or sets the offset distance.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

## Methods

### #ctor
Initializes a new instance of the NestedGridDivisionManualEdgeDefinition class.

### CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies NestedGridDivisionManualEdgeDefinition data from the specified NestedGridDivisionManualEdgeDefinition object.

- **`other`**: The other NestedGridDivisionManualEdgeDefinition object.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.