---
title: Autodesk.Aec.DatabaseServices.MaskBlockReference
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > MaskBlockReference
---

# Autodesk.Aec.DatabaseServices.MaskBlockReference

## Summary
Represents a mask block reference.

## Properties

### CutProfile
Get the cut profile of this mask block reference.

**Returns:** The cut profile of this mask block reference.

## Methods

### #ctor
Initializes a new instance of the MaskBlockReference class.