---
title: Autodesk.Aec.DatabaseServices.DatabaseData
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DatabaseData
---

# Autodesk.Aec.DatabaseServices.DatabaseData

## Summary
Represents a data base data.

## Properties

### Database
Gets the database.

### DrawingInitializedAndPromoted
Gets or sets if drawing is initialized and promoted.

## Methods

### #ctor
Initializes a new instance of the DatabaseData class.