---
title: Autodesk.Aec.DatabaseServices.LayoutGrid3d
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid3d
---

# Autodesk.Aec.DatabaseServices.LayoutGrid3d

## Summary
Represents a layout grid 3d. LayoutGrid3d builds onto VolumeLayoutTool by restricting node layouts to a regular 3d grid structure.

## Properties

### BaseGrid
Gets the base grid.

**Returns:** The base grid, or null if the grid was not defined yet.

### GridType
Gets the grid type.

**Returns:** Returns the grid type.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid3d class.