---
title: Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid3dVolume
---

# Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume

## Summary
Represents a layout grid 3d volume.

## Properties

### UIndex
Gets or sets the index on the U axis.

**Returns:** Returns the index on the U axis.

### VIndex
Gets or sets the index on the V axis.

**Returns:** Returns the index on the V axis.

### WIndex
Gets or sets the index on the W axis.

**Returns:** Returns the index on the W axis.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid3dVolume class.