---
title: Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsSystemEntityDrawData
---

# Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData

## Summary
Represents a drawing data of Graphics System Entity.

## Properties

### DbObject
Gets or sets the entity of the GraphicsSystemEntityDrawData object.

**Returns:** The specified entity.

### GsMarkerInformationTree
Gets or sets the GsMarker information tree of the GraphicsSystemEntityDrawData object.

**Returns:** The GsMarker information tree of the GraphicsSystemEntityDrawData object.

### IsBusy
Gets or sets the boolean value that indicates the busy status of the data.

**Returns:** Boolean value indicates the busy status of the data.

## Methods

### #ctor
Initializes a new instance of the GraphicsSystemEntityDrawData class.

### FreeDrawData
Frees the drawing data.