---
title: Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DisplayThemeComponentBase
---

# Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase

## Summary
Represents a display theme component base class.

## Properties

### DisplayProperties
Gets display properties.

**Returns:** Display component hatch.

### Name
Gets or sets the name of this display component hatch.

**Returns:** The name of this display component hatch.

### Rules
Gets or sets rules.

**Returns:** Rules.

## Methods

### #ctor
Initializes a new instance of the DisplayThemeComponentBase class.

### SupportsEntity(Autodesk.Aec.DatabaseServices.Entity)
Check if it supports entity.

- **`entity`**: Entity.

**Returns:** Ture if it supports, false otherwise.

### GetDisplayString()
Gets display String.