---
title: Autodesk.Aec.DatabaseServices.LayoutGrid2dCell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid2dCell
---

# Autodesk.Aec.DatabaseServices.LayoutGrid2dCell

## Summary
Represents a layout grid 2d cell.

## Properties

### UIndex
Gets or sets the index on the U axis.

**Returns:** Returns the index on the U axis.

### VIndex
Gets or sets the index on the V axis.

**Returns:** Returns the index on the V axis.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid2dCell class.