---
title: Autodesk.Aec.DatabaseServices.DictionaryMaterialDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryMaterialDefinition
---

# Autodesk.Aec.DatabaseServices.DictionaryMaterialDefinition

## Summary
Represents a material definition dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMaterialDefinition class using the specified database.

- **`db`**: The database.

### GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard definition id.

- **`db`**: The database.

**Returns:** Returns the standard definition id.