---
title: Autodesk.Aec.Modeler.Entity
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > Entity
---

# Autodesk.Aec.Modeler.Entity

## Summary
Represents an entity.

## Properties

### Flags
Flags property.

**Returns:** Gets the Flags property.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a wrapper class for Entity.

- **`unmanagedPointer`**: The native pointer.
- **`autoDelete`**: If it would be auto deleted.

### DeleteUnmanagedObject()
Deletes the unmanaged object.

**Returns:** void.