---
title: Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > NestedGridEdgeProfileOverride
---

# Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride

## Summary
Represents a nested grid edge profile override.

## Properties

### EdgePath
Gets or sets the edge path.

**Returns:** The edge path.

### ProfileId
Gets or sets the edge profile id.

**Returns:** The edge profile id.

### IsStyleBased
Gets or sets whether this override is style based.

**Returns:** True to indicate style based, or false otherwise.

## Methods

### #ctor
Initializes a new instance of the NestedGridEdgeProfileOverride class.

### CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies another override to this override.

- **`other`**: Input the other override.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.