---
title: Autodesk.Aec.Geometry.GridUvRectangular
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > GridUvRectangular
---

# Autodesk.Aec.Geometry.GridUvRectangular

## Summary
Represents a rectangular grid.

## Methods

### #ctor
Initializes a new instance of the GridUvRectangular class.