---
title: Autodesk.Aec.DatabaseServices.NestedGridDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > NestedGridDefinition
---

# Autodesk.Aec.DatabaseServices.NestedGridDefinition

## Summary
Represents a nested grid definition.

## Properties

### GridDivisionId
Gets or sets the grid division id.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

## Methods

### #ctor
Initializes a new instance of the NestedGridDefinition class.