---
title: Autodesk.Aec.DatabaseServices.GridCustomSegment
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridCustomSegment
---

# Autodesk.Aec.DatabaseServices.GridCustomSegment

## Summary
Represents a grid custom segment.

## Properties

### Id
Gets or sets the Id for this custom grid segment.

**Returns:** Returns the Id for this custom grid segment.

## Methods

### #ctor
Initializes a new instance of the GridCustomSegment class.

### #ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Initializes a new instance of the GridCustomSegment class using the specified curve.

- **`curve`**: A Curve2d.