---
title: Autodesk.Aec.DatabaseServices.MaterialDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > MaterialDefinition
---

# Autodesk.Aec.DatabaseServices.MaterialDefinition

## Summary
Represents a material definition.

## Methods

### #ctor
Initializes a new instance of the MaterialDefinition class.