---
title: Autodesk.Aec.Modeler.ConeSurface
hierarchy: AecBaseMgd > Autodesk > Aec > Modeler > ConeSurface
---

# Autodesk.Aec.Modeler.ConeSurface

## Summary
Represents a cone surface.

## Properties

### Radius
Gets the radius.

**Returns:** The radius.

### TanAngle
Gets the tan angle.

**Returns:** The tan angle.

### Approximation
Gets the approx.

**Returns:** The approx.

### Apex
Gets the apex point.

**Returns:** The apex point.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a wrapper class for ConeSurface.

### #ctor
Initializes a new instance of the ConeSurface class.

### #ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,System.Double,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the ConeSurface class using the specified line, readius, approx and body.

- **`axis`**: The axis.
- **`radius1`**: The first radius.
- **`radius2`**: The second radius.
- **`approx`**: The approx.
- **`body`**: The body.