---
title: Autodesk.Aec.DatabaseServices.DictionaryRecordNameTranslator
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryRecordNameTranslator
---

# Autodesk.Aec.DatabaseServices.DictionaryRecordNameTranslator

## Summary
Represents a dictionary record name translator.

## Methods

### #ctor
Initializes a new instance of the DictionaryRecordNameTranslator class.

### Create(System.IntPtr,System.Boolean)
Creates a new instance of the DictionaryRecordNameTranslator class.

- **`unmanagedPointer`**: Inputs the unmanaged pointer of DictionaryRecordNameTranslator object.
- **`autoDelete`**: Inputs true if unmanaged object is destroyed by wrapper, otherwise false.