---
title: Autodesk.Aec.DatabaseServices.DictionaryMultiViewBlockDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > DictionaryMultiViewBlockDefinition
---

# Autodesk.Aec.DatabaseServices.DictionaryMultiViewBlockDefinition

## Summary
Represents a multi view block definition dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMultiViewBlockDefinition class using the specified database.

- **`db`**: The drawing database.

### GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the id of the standard multiview block definition, which is always available, for the specified drawing database.

- **`db`**: The drawing database.

**Returns:** Returns the object id of the standard multiview block definition.