---
title: Autodesk.Aec.DatabaseServices.GridCustomNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridCustomNode
---

# Autodesk.Aec.DatabaseServices.GridCustomNode

## Summary
Represents a grid custom node.

## Properties

### NodeLocation
Returns the node location type.

**Returns:** Returns the node location type.

### SegmentId
Returns the segment Id.

**Returns:** Returns the segment Id.

## Methods

### #ctor
Initializes a new instance of the GridCustomNode class.

### GetIntersectionIds(Autodesk.AutoCAD.Geometry.IntegerCollection@,Autodesk.AutoCAD.Geometry.DoubleCollection@)
Returns the intersection Ids and parameters for this instance.

- **`ids`**: The segment ids.
- **`parameters`**: The segment parameters.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.