---
title: Autodesk.Aec.DatabaseServices.PolygonStyle
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > PolygonStyle
---

# Autodesk.Aec.DatabaseServices.PolygonStyle

## Summary
Represents a polygon style.

## Properties

### EdgeWidth
Gets or sets the edge width.

**Returns:** Returns the edge width.

### EdgeWidthJustifyType
Gets or sets the edge width justification type.

**Returns:** Returns the edge width justification type.

## Methods

### #ctor
Initializes a new instance of the PolygonStyle class.