---
title: Autodesk.Aec.DatabaseServices.OverrideMask
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > OverrideMask
---

# Autodesk.Aec.DatabaseServices.OverrideMask

## Summary
Represents a override mask.

## Properties

### MaskId
Gets or sets the ObjectId of the mask entity.

**Returns:** The ObjectId of the mask entity.

### ViewId
Gets or sets the ObjectId of the DisplayRep object that is being masked.

**Returns:** The ObjectId.

## Methods

### #ctor
Initializes a new instance of the OverrideMask class.