---
title: Autodesk.Aec.DatabaseServices.EntityCollectorData
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > EntityCollectorData
---

# Autodesk.Aec.DatabaseServices.EntityCollectorData

## Summary
Represents a Entity data collector.

## Methods

### Create(System.IntPtr,System.Boolean)
Creates a new instance of the EntityCollectorData class.

- **`unmanagedPointer`**: The native class pointer.
- **`autoDelete`**: The boolean value if deletes the native pointer.

### #ctor
Initializes a new instance of the EntityCollectorData class.