---
title: Autodesk.Aec.DatabaseServices.IndexSpecifierLocation
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > IndexSpecifierLocation
---

# Autodesk.Aec.DatabaseServices.IndexSpecifierLocation

## Summary
Represents an index specifier location.

## Properties

### AppliesToStartIndex
Gets or sets the applies to start index state.

### AppliesToEndIndex
Gets or sets the applies to end index state.

### AppliesToMiddleIndex
Gets or sets the applies to middle index state.

## Methods

### #ctor
Initializes a new instance of the IndexSpecifierLocation class.