---
title: Autodesk.Aec.DatabaseServices.Section2dHatchRegion
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Section2dHatchRegion
---

# Autodesk.Aec.DatabaseServices.Section2dHatchRegion

## Summary
Represents a section 2d hatch region.

## Properties

### HatchProfile
Gets or sets the hatch profile.

**Returns:** The hatch profile.

### HasMaterialFilter
Gets whether the hatch has material filter.

**Returns:** true the hatch has material filter, or false otherwise.

### MaterialFilter
Sets the material filter.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### Id
Gets the hatch region id.

**Returns:** The id.

### AppliesToSurfaceHatch
Gets or sets whether this applies to surface hatch.

**Returns:** true if this applies to surface hatch, or false otherwise.

### AppliesToSectionHatch
Gets or sets whether this applies to section hatch.

**Returns:** true if this applies to section hatch, or false otherwise.

### AppliesToMaterialLineWork
Gets or sets whether this applies to material line work.

**Returns:** true if this applies to material line work, or false otherwise.

### AppliesToShrinkWrapLineWork
Gets or sets whether this applies to shrink wrap line work.

**Returns:** true if this applies to shrink wrap line work, or false otherwise.

### AppliesToShrinkWrapHatch
Gets or sets whether this applies to shrink wrap hatch.

**Returns:** true if this applies to shrink wrap hatch, or false otherwise.

### IsSubtractive
Gets or sets whether this is subtractive.

**Returns:** true if this is subtractive, or false otherwise.

## Methods

### #ctor
Initializes a new instance of the Section2dHatchRegion class.