---
title: Autodesk.Aec.ApplicationServices.DBVariables
hierarchy: AecBaseMgd > Autodesk > Aec > ApplicationServices > DBVariables
---

# Autodesk.Aec.ApplicationServices.DBVariables

## Summary
Represents the database variables.

## Methods

### #ctor
Initializes a new instance of the DBVariables class.