---
title: Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > AnchorEntityToLayoutCell
---

# Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell

## Summary
Represents an entity to a layout cell anchor.

## Properties

### ResizeOffset
Gets or sets the resize offset value.

**Returns:** Returns the resize offset value.

### ApplyResize
Gets or sets the apply resize value.

**Returns:** Returns the apply resize value.

## Methods

### #ctor
Initializes a new instance of the AnchorEntityToLayoutCell class.