---
title: Autodesk.Aec.DatabaseServices.Classification
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Classification
---

# Autodesk.Aec.DatabaseServices.Classification

## Summary
Represents a classification.

## Properties

### OwningSystemId
Gets the owning system id.

**Returns:** Returns the owning system id.

### NameAndDescription
Gets the formatted name and description.

**Returns:** Returns the formatted name and description.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### OwningSystemName
Gets the owning system name.

**Returns:** Returns the owning system name.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.