---
title: Autodesk.Aec.DatabaseServices.GridAssemblyInterference
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GridAssemblyInterference
---

# Autodesk.Aec.DatabaseServices.GridAssemblyInterference

## Summary
Represents a grid assembly interference.

## Properties

### EntityId
Gets or sets the object Id of the interference entity.

**Returns:** Return the object Id of the interference entity.

### AppliesToFlags
Gets or sets the interference flags.

**Returns:** Returns the interference flags.

## Methods

### #ctor
Initializes a new instance of the GridAssemblyinterference class.