---
title: Autodesk.Aec.DatabaseServices.MaskBlockDefinition
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > MaskBlockDefinition
---

# Autodesk.Aec.DatabaseServices.MaskBlockDefinition

## Summary
Represents a mask block definition.

## Properties

### CutProfile
Gets or sets the cut profile.

**Returns:** Returns the cut profile.

### ExtraGraphicsBlockId
Gets or sets the extra graphics block id.

**Returns:** Returns the extra graphics block id.

## Methods

### #ctor
Initializes a new instance of the MaskBlockDefinition class.