---
title: Autodesk.Aec.DatabaseServices.Attribute
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > Attribute
---

# Autodesk.Aec.DatabaseServices.Attribute

## Summary
Represents an AEC attribute.

## Methods

### #ctor
Initializes a new instance of the Attribute class.

### Copy
Creates a copy of this attribute.

**Returns:** A copy of this attribute.