---
title: Autodesk.Aec.DatabaseServices.SectionVertex
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > SectionVertex
---

# Autodesk.Aec.DatabaseServices.SectionVertex

## Summary
Represents a section vertex.

## Properties

### Location
Gets or sets the location.

**Returns:** The location point.

## Methods

### #ctor
Initializes a new instance of the SectionVertex class.