---
title: Autodesk.Aec.DatabaseServices.LayoutGrid2dNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutGrid2dNode
---

# Autodesk.Aec.DatabaseServices.LayoutGrid2dNode

## Summary
Represents a layout grid 2d node.

## Properties

### VPosition
Gets or sets the node position on the V axis.

**Returns:** Returns the node position on the V axis.

## Methods

### #ctor
Initializes a new instance of the LayoutGrid2dNode class.