---
title: Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > IndexSpecifierExplicit
---

# Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit

## Summary
Represents an index specifier location.

## Properties

### IndexArray
Gets the array of integer indexes.

## Methods

### #ctor
Initializes a new instance of the IndexSpecifierExplicit class.

### AppendToIndexArray(System.Integer)
Appends a new index to the array.

- **`index`**: Input index to append.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### RemoveFromIndexArray(System.Integer)
Removes the specified index from the array.

- **`index`**: Input index to remove.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

### ClearIndexArray()
Clears the index array.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.