---
title: Autodesk.Aec.Geometry.CompoundSegment2d
hierarchy: AecBaseMgd > Autodesk > Aec > Geometry > CompoundSegment2d
---

# Autodesk.Aec.Geometry.CompoundSegment2d

## Summary
Represents a compound segment 2d.

## Properties

### GraphiSystemMarker
Returns the graphic system marker.

**Returns:** Returns the graphic system marker.

**Remarks:**
Applies to the plan view display of a wall.

### GraphicSystemMarker
Sets the graphic system marker.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.

**Remarks:**
Applies to the plan view display of a wall.

## Methods

### #ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Initializes a new instance of the CompoundSegment2d class using the specified curve.