---
title: Autodesk.Aec.DatabaseServices.GraphicsStorageHatch
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > GraphicsStorageHatch
---

# Autodesk.Aec.DatabaseServices.GraphicsStorageHatch

## Summary
Represents a graphics storage that stores hatch data.

## Properties

### Vectors
Gets the vectors of the hatch.

**Returns:** The vectors of the hatch.

### HatchType
Gets the hatch type.

**Returns:** The hatch type.