---
title: Autodesk.Aec.DatabaseServices.RXClassToObjectId
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > RXClassToObjectId
---

# Autodesk.Aec.DatabaseServices.RXClassToObjectId

## Summary
Represents a class consisting of RXClass type and corresponding all object ids.

## Properties

### Type.
Gets the RXClass type.

### Type(Autodesk.AutoCAD.Runtime.RXClass)
Sets the RXClass type.

### Ids.
Gets the collection of object ids.

### Ids(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets the collection of object ids.

## Methods

### #ctor.
Initializes a new instance of the RXClassToObjectId class.

### op_Equality(Autodesk.Aec.DatabaseServices.RXClassToObjectId, Autodesk.Aec.DatabaseServices.RXClassToObjectId)
Compares equality of two objects of RXClassToObjectId type.

### op_Inequality(Autodesk.Aec.DatabaseServices.RXClassToObjectId, Autodesk.Aec.DatabaseServices.RXClassToObjectId)
Compares inequality of two objects of RXClassToObjectId type.