---
title: Autodesk.Aec.DatabaseServices.LayoutCurveNode
hierarchy: AecBaseMgd > Autodesk > Aec > DatabaseServices > LayoutCurveNode
---

# Autodesk.Aec.DatabaseServices.LayoutCurveNode

## Summary
Represents a layout curve node.

## Properties

### UPosition
Gets or sets the node position on the U axis.

**Returns:** Returns node position.

## Methods

### #ctor
Initializes a new instance of the LayoutCurveNode class.