---
title: Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeNode
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > ScheduleTableStyleHeaderTreeNode
---

# Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderTreeNode

## Summary
Represents a ScheduleTableStyleHeaderTreeNode.

## Methods

### #ctor
Initializes a new instance of the ScheduleTableStyleHeaderTreeNode class.