---
title: Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleTableUniqueVariantCollection
---

# Autodesk.Aec.PropertyData.ScheduleTableUniqueVariantCollection

## Summary
Represents a collection of Schedule Table Unique Variant.

## Properties

### Count
Gets the count.

**Returns:** The count.

### Item
Returns the item at the given index.

- **Exception `T:System.ArgumentOutOfRangeException`**: System.ArgumentOutOfRangeException.

### IsSynchronized
Is synchronized.

**Returns:** If it is synchronized.

### IsFixedSize
If it is fixed size.

**Returns:** If it is fixed size.

### IsReadOnly
Gets if it is readonly.

**Returns:** If it is readonly.

### SplitDelimitedValues
Gets if split delimited values.

**Returns:** True if it split delimited values, false otherwise.

## Methods

### #ctor()
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.

### #ctor(System.Boolean)
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.

- **`keepEmpty`**: If it keep empty.

### #ctor(System.Boolean,System.Int32)
Initializes a new instance of the ScheduleTableUniqueVariantCollection class.

- **`keepEmpty`**: If it keep empty.
- **`limit`**: The limit.

### CopyTo(System.Array,System.Int32)
Copy to array.

- **`array`**: The target array.
- **`start`**: The start position to copy.

### GetEnumerator
Returns an enumerator for this collection.

**Returns:** Returns an enumerator for this collection.

### Add(System.Object)
Add value.

- **`value`**: The value.

**Returns:** The added index.

### Contains(System.Object)
If contains value.

- **`value`**: The value.

**Returns:** True if contains value, false other wise.

### IndexOf(System.Object)
Determines the index of the specified item.

- **`value`**: The item.

**Returns:** Returns the index of the specified item.

### Dump
Dump.