---
title: Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleHeaderPositionNode
---

# Autodesk.Aec.PropertyData.ScheduleHeaderPositionNode

## Summary
Represents a Schedule Header Position Node.

## Properties

### Heading
Gets the heading.

### Position
Gets the position.

### HeaderNode
Gets the header node.

## Methods

### #ctor(System.String,Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition,Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode)
Initializes a new instance of the ScheduleHeaderPositionNode class using the specified header, position and header node.

- **`header`**: Header.
- **`position`**: Position.
- **`headerNode`**: Header Node.