---
title: Autodesk.Aec.PropertyData.ScheduleTableColumnOrderSingleColumn
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleTableColumnOrderSingleColumn
---

# Autodesk.Aec.PropertyData.ScheduleTableColumnOrderSingleColumn

## Summary
Represents schedule table column order single column.

## Methods

### #ctor(Autodesk.Aec.PropertyData.ScheduleTableVariantMatrix,System.Int32,System.Boolean)
Initializes a new instance of the ScheduleTableColumnOrderSingleColumn class using the specified variant matrix and column.

- **`matrix`**: The variant matrix.
- **`column`**: The column.
- **`ascending`**: Indicate the sorting way.