---
title: Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleTableHeaderPosition
---

# Autodesk.Aec.PropertyData.ScheduleTableHeaderPosition

## Summary
Represents a Schedule Table Header Position.

## Properties

### Left
Gets or sets left.

### Right
Gets or sets right.

### Bottom
Gets or sets bottom.

### Top
Gets or sets top.

## Methods

### #ctor
Initializes a new instance of the ScheduleTableHeaderPosition class.

### #ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the ScheduleTableHeaderPosition class.

- **`left`**: Left.
- **`right`**: Right.
- **`bottom`**: Bottom.
- **`top`**: Top.