---
title: Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > ScheduleTableColumn
---

# Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableColumn

## Summary
Represents a schedule table column.

## Properties

### CellWidth
Gets or sets the cell width.

### CellX
Gets or sets the cell x.

### MatrixValues
Gets or sets the matrix values.

## Methods

### #ctor
Initializes a new instance of the ScheduleTableColumn class.

### SetFixedCellWidth(System.Double)
Sets the fixed cell width.

- **`cellWidth`**: The cell width.