---
title: Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > PropertyValueUnitPair
---

# Autodesk.Aec.PropertyData.DatabaseServices.PropertyValueUnitPair

## Summary
Represents a value-unit pair for a given property.

## Properties

### UnitType
Gets the unit type.

**Returns:** The unit type.

**Remarks:**
Applies only to those properties that return a real number.

### Value
Gets the value.

**Returns:** The value.

## Methods

### DeleteUnmanagedObject
Disposes the unit type.