---
title: Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleTableHeaderPositionIterator
---

# Autodesk.Aec.PropertyData.ScheduleTableHeaderPositionIterator

## Summary
Represents a Schedule Table Header Position Iterator.

## Properties

### Next
Next ScheduleHeaderPositionNode.

**Returns:** The next scheduleHeaderPositionNode.

## Methods

### Create(System.IntPtr,System.Boolean)
Initializes a new instance of the ScheduleTableHeaderPosition class.

### Reset
Reset the iterator.