---
title: Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > ScheduleTableStyleHeaderNode
---

# Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode

## Summary
Represents a ScheduleTableStyleHeaderNode.

## Properties

### Level
Gets the level property.

**Returns:** The Level.

### Children
Gets the child nodes of this node.

**Returns:** The collection of all child nodes.

### Parent
Gets the parent node.

**Returns:** The parent node.

### Text
Gets or sets the text value.

**Returns:** The text value.

### FormatOverride
Gets or sets the format value.

## Methods

### #ctor
Initializes a new instance of the ScheduleTableStyleHeaderNode class.

### SetTreeParent(Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableStyleHeaderNode)
Sets the tree parent.

- **`parent`**: The parent node.