---
title: Autodesk.Aec.PropertyData.ScheduleTableColumnOrderAllColumns
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > ScheduleTableColumnOrderAllColumns
---

# Autodesk.Aec.PropertyData.ScheduleTableColumnOrderAllColumns

## Summary
Represents  schedule table column order all columns.

## Methods

### #ctor(Autodesk.Aec.PropertyData.ScheduleTableVariantMatrix,System.Boolean)
Initializes a new instance of the ScheduleTableColumnOrderAllColumns class using the specified variant matrix.

- **`matrix`**: The variant matrix.
- **`ascending`**: Indicates if sort columns by ascending.