---
title: Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > PropertyDefinitionProject
---

# Autodesk.Aec.PropertyData.DatabaseServices.PropertyDefinitionProject

## Summary
Represents a project property definition.

## Remarks
Project property values are obtained from the drawing management project in which an object is located.

## Properties

### ProjectDataType
Gets or sets the project data type.

**Returns:** Returns the project data type.

### ProjectDetailCategory
Gets or sets the project detail category.

**Returns:** Returns the project detail category.

### ProjectDetailName
Gets or sets the project detail name.

**Returns:** Returns the project detail name.

### UseProjectInfoForDescription
Gets or sets whether the project information should be used for description.

**Returns:** Returns whether the project information should be used for description.

## Methods

### #ctor
Initializes a new instance of the PropertyDefinitionProject class.

### GetDisplayString(Autodesk.Aec.PropertyData.DatabaseServices.ProjectDataType)
Gets the display string of the specified project data type.

- **`type`**: The specified project data type.