---
title: Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > ScheduleTableCellFormatOverride
---

# Autodesk.Aec.PropertyData.DatabaseServices.ScheduleTableCellFormatOverride

## Summary
Represents a schedule table cell format override.

## Properties

### HasOverrides
Gets if it has overrides.

### OverrideTextStyleId
Gets if it override text style id.

### OverrideAlignment
Gets override alignment.

### OverrideWidth
Gets the override width.

### OverrideHeight
Gets override height.

### OverrideGap
Gets override gap.

### OverrideRotationType
Override rotation type.

### OverrideMatrixSymbolType
Gets the override matrix symbol type.

### OverrideUseMatrixForTrueFalse
Gets the override use matrix for true false.

### DefaultCellFormat
Gets or sets the default cell format.

## Methods

### #ctor
Initializes a new instance of the ScheduleTableCellFormatOverride class.

### ClearTextStyleIdOverride
Clear text style id override.

### ClearAlignmentOverride
Clear alignment override.

### ClearWidthOverride
Clear width override.

### ClearHeightOverride
Clear height override.

### ClearGapOverride
Clear gap override.

### ClearRotationTypeOverride
Clear rotation type override.

### ClearMatrixSymbolTypeOverride
Clear matrix symbol type override.

### ClearUseMatrixForTrueFalseOverride
Clear use matrix for true false override.