---
title: Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > AnchorTagToEntity
---

# Autodesk.Aec.PropertyData.DatabaseServices.AnchorTagToEntity

## Summary
Represents a AnchorTagToEntity.

## Properties

### EntityId
Gets or sets the entity id.

## Methods

### #ctor
Initializes a new instance of the AnchorTagToEntity class.

### SetOverride(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets override.

- **`entityId`**: The entity id.
- **`blockReferencePath`**: The block reference path.

- **Exception `T:Autodesk.AutoCAD.Runtime.Exception`**: Autodesk.AutoCAD.Runtime.Exception.