---
title: Autodesk.Aec.PropertyData.DatabaseServices.DictionaryScheduleTableStyle
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > DictionaryScheduleTableStyle
---

# Autodesk.Aec.PropertyData.DatabaseServices.DictionaryScheduleTableStyle

## Summary
Represents a schedule table style dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryScheduleTableStyle class using the specified database.

- **`db`**: The database.

### GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard table style id.

- **`db`**: The database.

**Returns:** The standard table style id.