---
title: Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > AnchorExtendedTagToEntity
---

# Autodesk.Aec.PropertyData.DatabaseServices.AnchorExtendedTagToEntity

## Summary
Represents a AnchorExtendedTagToEntity.

## Properties

### ReferencedEntityId
Gets or sets the referenced entity id.

**Returns:** The referenced entity id.

### ForceHorizontal
Gets or sets the force horizontal.

### AllowIndependentUpdate
Gets or sets allow independent update.

## Methods

### #ctor
Initializes a new instance of the AnchorExtendedTagToEntity class.

### SetReferencedEntityId(Autodesk.Aec.DatabaseServices.Geo)
Set referenced entity id.

- **`geo`**: The geo.

### SetReferencedEntityOldEcs(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets referenced entity old ecs.

- **`mat`**: The matrix.