---
title: Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertyDataFormat
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > DictionaryPropertyDataFormat
---

# Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertyDataFormat

## Summary
Represents a property data format dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPropertyDataFormat class using the specified database.

- **`db`**: The database.

### GetStandardFormat(Autodesk.AutoCAD.DatabaseServices.Database)
Get standard format.

- **`db`**: The database.