---
title: Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertySetDefinitions
hierarchy: AecPropDataMgd > Autodesk > Aec > PropertyData > DatabaseServices > DictionaryPropertySetDefinitions
---

# Autodesk.Aec.PropertyData.DatabaseServices.DictionaryPropertySetDefinitions

## Summary
Represents a property set definition dictionary.

## Methods

### #ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPropertySetDefinitions class using the specified database.

- **`db`**: The database.